# 15. Lambda function in Python

 * __A Lambda function is a small anonymous(function without their name) function.__
 * __A Lambda function can take any number of arguments, but only have one expressions.__
 * __The expression is evaluated and returned.__
 * __Lambda expressions(or lambda function) essentially blocks of code that can be assigned to variable, passed as an agurments, or returned from a funciton call, in Language that support high-order functions.__
 * __The main role of lambda function is better described in the scenerios when we employ them anonymously inside another functions.__
 * __In Python, the lambda function can be utilized as an arguments to the higher-order funcitons as an arugments.__
   * __Lambda functions in python__
     * __syntax:__
     * __Normal Functions__
     * __Anonymous function__
   * __Usages__
     * __Lambda with filters()__
     * __Lambda with map()__
     * __Lambda with reduce()__
     * __Lambda with apply()__
   * __CommonErrors__
     * __SyntaxError__
     * __TypeError__

In [1]:
# UserDefined function

# two number addition

def additionTwo(x,y):
    return x+y
additionTwo(2,30)

32

In [2]:
additionTwo(10,20)

30

In [6]:
(lambda x,y:x+y)(10,15)

25

In [7]:
# num1 = 20

# function 

def sqrNum(n):
    return n**2
sqrNum(20)

400

In [8]:
(lambda a:a**2)(20)

400

In [9]:
sqrNum(50)

2500

In [10]:
def sqrNum(n):
    return n**2

x = int(input("Enter any value: "))
sqrNum(x)

Enter any value:  15

225

In [11]:
a1 = int(input("enter any value: "))
(lambda a:a**2)(a1)

enter any value:  78

6084

In [12]:
# even or odd numbers

arrayList = [1,2,3,4,5,6,7,8,9,10]

def arraysum(l):
    even = []
    odd = []
    for i in l:
        if i % 2 == 0:
            even.append(i)
        else:
            odd.append(i)
    print(even)
    print(odd)
    # print(sum)
arraysum(arraylist)

[2, 4, 6, 8, 10]
[1, 3, 5, 7, 9]

In [14]:
arraylist = [1,2,3,4,5,6,7,8,9,10]

(lambda x:x%2==0)(11)

False

In [16]:
# Lambda with filters()
arraylist = [1,2,3,4,5,6,7,8,9,10]

# syntax: filter(function, sequence)

In [18]:
def even(n):
    if n%2==0:
        return n
even(10)

10

In [21]:
list(filter(even, arraylist))

[2, 4, 6, 8, 10]

In [24]:
tuple(filter(lambda x:x%2==0, arraylist))

(2, 4, 6, 8, 10)

In [26]:
def oddNum(n):
    if n%2!=0:
        return n
oddNum(10)

In [28]:
list(filter(oddNum, arraylist))

[1, 3, 5, 7, 9]

In [30]:
list(filter(lambda a:a%2!=0, arraylist))

[1, 3, 5, 7, 9]

In [ ]:
arrayList1 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
# sqrofNumber

In [31]:
arraylist = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
sqr = []
for i in arraylist:
    sqr.append(i**2)
print(sqr)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, 361, 400]

In [32]:
arraylist = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]

squared_list = []
list(filter(lambda x: squared_list.append(x**2), arraylist))

print(squared_list)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, 361, 400]

In [47]:
# above 10 number and below 10 number
arraylist = [1,2,3,4,5,6,7,8,9,-11,50,45,-100,-88,-90,15,-20]

def

In [48]:
a = [1,2,3,11,22,4,55,66]
def above(n):
    if n >= 10:
        return n

list(filter(above, a))

[11, 22, 55, 66]

In [49]:
a = [1,2,3,11,22,4,55,66]
def below(n):
    if n < 10:
        return n

list(filter(below, a))

[1, 2, 3, 4]

In [50]:
arraylist1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, -11, 50, 45, -100, -88, -90, 15, -20]

numbers = list(filter(lambda x: x < 10, arraylist1))

print(numbers)


numbers = list(filter(lambda x: x > 10, arraylist1))

print(numbers)

[1, 2, 3, 4, 5, 6, 7, 8, 9, -11, -100, -88, -90, -20]
[50, 45, 15]

In [51]:
a = [1,2,3,11,22,4,55,66]
list(filter(lambda x: x >= 10, a))

a = [1,2,3,11,22,4,55,66]
list(filter(lambda x: x < 10, a))

[1, 2, 3, 4]

In [52]:
weekdays = ['Monday',"Tuesday","Wednesday","Thursday","Friday","Saturday","Sunday"]

# print only above 6 characters value 

weekdays = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]
def above(n):
    return  len(n)> 6

list(filter(above, weekdays))

['Tuesday', 'Wednesday', 'Thursday', 'Saturday']

In [53]:

weekdays = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]

list(filter(lambda x: len(x)>6, weekdays))

['Tuesday', 'Wednesday', 'Thursday', 'Saturday']

In [63]:
# Lambda with map()
arraylist1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, -11, 50, 45, -100, -88, -90, 15, -20]

def sqrNum(n):
    x = n**2
    return x

In [66]:
list(map(sqrNum,arraylist1))

[1, 4, 9, 16, 25, 36, 49, 64, 81, 121, 2500, 2025, 10000, 7744, 8100, 225, 400]

In [67]:
4**2  #

16

In [68]:
x="Hello world"
len(x)>6

True

In [3]:
# Lambda with reduce()
from functools import reduce
list1 = [3,6,9,12,15,18,21,24,27,30]

# syntax 
# reduce(function, sequence)

# sum(list1)

def sumVal(x,y):
    return x+y

In [4]:
reduce(sumVal,list1)

165

In [5]:
def subVal(a,b):
    return a-b

reduce(subVal,list1)

-159

In [6]:
def multVal(a,b):
    return a*b
reduce(multVal, list1)

214277011200

In [7]:
def divisionVal(a,b):
    return a/b
reduce(divisionVal,list1)

4.200170587408306e-11

In [9]:
# 4.200170587408306**11

In [10]:
# with lambda 

reduce(lambda a,b:a+b, list1)

165

In [11]:
reduce(lambda a,b:a-b, list1)

-159

In [12]:
reduce(lambda a,b:a*b,list1)

214277011200

In [13]:
reduce(lambda a,b:a/b, list1)

4.200170587408306e-11

In [14]:
# Lambda with apply()

from pandas import pandas

In [16]:
help(pandas)

IOPub data rate exceeded.
The Jupyter server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--ServerApp.iopub_data_rate_limit`.

Current values:
ServerApp.iopub_data_rate_limit=1000000.0 (bytes/sec)
ServerApp.rate_limit_window=3.0 (secs)

In [17]:
import pandas as pd

In [18]:
help(pd)

IOPub data rate exceeded.
The Jupyter server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--ServerApp.iopub_data_rate_limit`.

Current values:
ServerApp.iopub_data_rate_limit=1000000.0 (bytes/sec)
ServerApp.rate_limit_window=3.0 (secs)

In [19]:
# work with apply

# 1-D,2-D, 3-D
x = [1,2,3,4,5,6,4,5,9,10]
print(x)

[1, 2, 3, 4, 5, 6, 4, 5, 9, 10]

In [20]:
df = pd.DataFrame(x)
df

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   4
7   5
8   9
9  10

In [21]:
df.size

10

In [23]:
df.shape

(10, 1)

In [122]:
# creating 2-D dimension: row- column

x1 = [[1,2,3],[4,5,6],[7,8,9],[10,11,12]]


print(x1)

[[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]]

In [92]:
print(type(x1))

<class 'list'>

In [123]:
df2 = pd.DataFrame(x1)
df2

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [94]:
df2.size

12

In [95]:
df2.shape

(4, 3)

In [96]:
df2[0][0]

np.int64(1)

In [97]:
df2[0][1]

np.int64(4)

In [98]:
df2[0][2]

np.int64(7)

In [99]:
df2[0][3]

np.int64(10)

In [100]:
df2[1][0]

np.int64(2)

In [101]:
df2[1][2] = 20

C:\Users\User\AppData\Local\Temp\ipykernel_2732\42193409.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df2[1][2] = 20

In [102]:
df2

    0   1   2
0   1   2   3
1   4   5   6
2   7  20   9
3  10  11  12

In [103]:
df2[2][3] = 120

C:\Users\User\AppData\Local\Temp\ipykernel_2732\1709287212.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df2[2][3] = 120

In [104]:
df2

    0   1    2
0   1   2    3
1   4   5    6
2   7  20    9
3  10  11  120

In [105]:
for i,j in df2.items():
    # print(j)
    pass

In [106]:
df2

    0   1    2
0   1   2    3
1   4   5    6
2   7  20    9
3  10  11  120

In [107]:
# with apply

df3 = df2.apply(lambda y:y+5)
df3

    0   1    2
0   6   7    8
1   9  10   11
2  12  25   14
3  15  16  125

In [108]:
df2

    0   1    2
0   1   2    3
1   4   5    6
2   7  20    9
3  10  11  120

In [109]:
df4 = df2.apply(lambda a:a**2)
df4

     0    1      2
0    1    4      9
1   16   25     36
2   49  400     81
3  100  121  14400

In [110]:
df2

    0   1    2
0   1   2    3
1   4   5    6
2   7  20    9
3  10  11  120

In [111]:
df2

    0   1    2
0   1   2    3
1   4   5    6
2   7  20    9
3  10  11  120

In [112]:
df4 = df2.apply(lambda b:b**3)
df4

      0     1        2
0     1     8       27
1    64   125      216
2   343  8000      729
3  1000  1331  1728000

In [113]:
# apply(function, array)

def sumVal(a):
    return a+10

In [114]:
df5 = df2.apply(sumVal)
df5

    0   1    2
0  11  12   13
1  14  15   16
2  17  30   19
3  20  21  130

In [ ]:
df2 = df2 + 5

6 =  1 + 5

In [115]:
df2

    0   1    2
0   1   2    3
1   4   5    6
2   7  20    9
3  10  11  120

In [118]:
df6 = df2.apply(lambda a:a+5)

df6

    0   1    2
0   6   7    8
1   9  10   11
2  12  25   14
3  15  16  125

In [124]:
for i, j in df2.items():
    df2 = df2 + 5
    print(df2)

    0   1   2
0   6   7   8
1   9  10  11
2  12  13  14
3  15  16  17
    0   1   2
0  11  12  13
1  14  15  16
2  17  18  19
3  20  21  22
    0   1   2
0  16  17  18
1  19  20  21
2  22  23  24
3  25  26  27

In [121]:
df2

    0   1    2
0  16  17   18
1  19  20   21
2  22  35   24
3  25  26  135

In [125]:
df2

    0   1   2
0  16  17  18
1  19  20  21
2  22  23  24
3  25  26  27

In [126]:
# 5. Sort the following list of tuples by the second value using a lambda function:
data = [(1, 3), (2, 1), (4, 2)]


# lambda with sorted

# sorted(iterable, key=".....",reverse="......")


num = [5,2,9,1,7]
# descending order
sortedNum = sorted(num,key=lambda x:x, reverse=True)
sortedNum

[9, 7, 5, 2, 1]

In [127]:
sortedNum = sorted(num,key=lambda x:x, reverse=False)
sortedNum

[1, 2, 5, 7, 9]

In [131]:
data = [(1, 3, 5), (2, 1, 6), (4, 2, 7)]


# syntax :
# sorted(iterable, key="........")

sortedVal = sorted(data, key=lambda x:x[0])
sortedVal

[(1, 3, 5), (2, 1, 6), (4, 2, 7)]

In [132]:
sortedVal = sorted(data, key=lambda x:x[1])
sortedVal

[(2, 1, 6), (4, 2, 7), (1, 3, 5)]

In [133]:
sortedVal = sorted(data, key=lambda x:x[2])
sortedVal

[(1, 3, 5), (2, 1, 6), (4, 2, 7)]

In [141]:
def sortedVal1(x):  # sortedVal(1)
    return lambda y:y[x]

In [145]:
sortedValue = sorted(data, key=sortedVal1(0))
sortedValue

[(1, 3, 5), (2, 1, 6), (4, 2, 7)]

In [146]:
# 1. Write a lambda function to calculate the square of a number.
def sqr(n):
    return (lambda x : x**2)(n)
print(sqr(5))

25

In [149]:
(lambda y:y**2)(5)

25

In [151]:
# 1. Write a lambda function to calculate the square of a number.
sqaure = (lambda x : x ** 2)

sqaure(4)

16

In [152]:
# 2. Use a lambda function with map() to add 5 to each number in the list:
#    nums = [1, 2, 3, 4]

def add(n):
    return n+5
    
nums = [1, 2, 3, 4]
list(map(add, nums))

[6, 7, 8, 9]

In [153]:
# 3. Use filter() with a lambda to find even numbers from a list:
nums = [5, 8, 11, 14, 17, 20]
def even(n):
    return (lambda x: x%2==0)(n)
list(filter(even, nums))

[8, 14, 20]

In [154]:
# 4. Use reduce() with a lambda to compute the product of all elements in a list:
#    nums = [2, 3, 4, 5]
#    *(Hint: from functools import reduce)*
from functools import reduce
nums = [2, 3, 4, 5]
print(reduce(lambda x, y : x*y, nums))

120

In [159]:
# 6. Write a lambda that checks if a string starts with 'A'.
def start_A(a):
    return (lambda x: x[0] == "A")(a)

a = "addk".upper()
start_A(a)

True

In [163]:
# 7. Use a lambda function with map() to convert a list of Celsius temperatures to Fahrenheit:
#    temps = [0, 20, 37, 100]

temps = [0, 20, 37, 100]
def temp1(c):
    return (lambda x:( x*(9/5)) + 32)(c)

print(f"°C to °F : {temp1(temps)}°F")

TypeError: can't multiply sequence by non-int of type 'float'

In [164]:
# 8. Given a list of strings, filter all strings with length > 3 using a lambda:
words = ['pen', 'notebook', 'apple', 'go']
def above_3(n):
    return (lambda x : len(x) > 3)(n)

list(filter(above_3, words))

['notebook', 'apple']

In [165]:
# 9. Create a lambda that takes two arguments and returns their average.
print((lambda x, y : (x+y)/2)(5, 9))

7.0

In [166]:
# 10. Use a lambda and map() to capitalize the first letter of each word in a list:
words = ['python', 'lambda', 'function']
def capital(n):
    return (lambda x: x.title())(n)

list(map(capital, words))

['Python', 'Lambda', 'Function']